Revit 2027 API
RoomTagFilter Constructor
 Constructs a filter which matches only rooms.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoomTagFilter()
Public Sub New
public:
RoomTagFilter()
new : unit -> RoomTagFilter
See Also
Reference
RoomTagFilter Class
Autodesk.Revit.DB.Architecture Namespace